class_name: Model
config:
  input_layers:
  - [tagIntent_input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 5, 157]
      input_dtype: float32
      name: tagIntent_input
    inbound_nodes: []
    name: tagIntent_input
  - class_name: LSTM
    config: {U_regularizer: null, W_regularizer: null, activation: tanh, b_regularizer: null,
      consume_less: cpu, dropout_U: 0.0, dropout_W: 0.0, forget_bias_init: one, go_backwards: false,
      init: glorot_uniform, inner_activation: hard_sigmoid, inner_init: orthogonal,
      input_dim: 157, input_length: null, name: LSTM_forward, output_dim: 64, return_sequences: false,
      stateful: false, trainable: true, unroll: false}
    inbound_nodes:
    - - [tagIntent_input, 0, 0]
    name: LSTM_forward
  - class_name: LSTM
    config: {U_regularizer: null, W_regularizer: null, activation: tanh, b_regularizer: null,
      consume_less: cpu, dropout_U: 0.0, dropout_W: 0.0, forget_bias_init: one, go_backwards: true,
      init: glorot_uniform, inner_activation: hard_sigmoid, inner_init: orthogonal,
      input_dim: 157, input_length: null, name: LSTM_backward, output_dim: 64, return_sequences: false,
      stateful: false, trainable: true, unroll: false}
    inbound_nodes:
    - - [tagIntent_input, 0, 0]
    name: LSTM_backward
  - class_name: Dropout
    config: {name: dropout_1, p: 0.5, trainable: true}
    inbound_nodes:
    - - [LSTM_forward, 0, 0]
    name: dropout_1
  - class_name: Dropout
    config: {name: dropout_2, p: 0.5, trainable: true}
    inbound_nodes:
    - - [LSTM_backward, 0, 0]
    name: dropout_2
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_bidirections,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [dropout_1, 0, 0]
      - [dropout_2, 0, 0]
    name: merge_bidirections
  - class_name: Dense
    config: {W_constraint: null, W_regularizer: null, activation: sigmoid, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
      name: dense_1, output_dim: 66, trainable: true}
    inbound_nodes:
    - - [merge_bidirections, 0, 0]
    name: dense_1
  name: model_1
  output_layers:
  - [dense_1, 0, 0]
keras_version: 1.0.8
